#!/bin/sh

##########################################################################################################################################################
# Déclaration de la variable de test #
######################################
CONTENEUR=Flaresolverr
IMAGE=ghcr.io/flaresolverr/flaresolverr
HTTP=1115:8191
RESTART=unless-stopped

##########################################################################################################################################################
# Fermeture du Conteneur #
##########################
docker container rm -f  $CONTENEUR

##########################################################################################################################################################
# Lancement du Conteneur #
##########################
docker create -i -t \
--name=$CONTENEUR \
--restart $RESTART \
--network=container:"NordVPN" \
--hostname $CONTENEUR \
--env LOG_LEVEL=${LOG_LEVEL:-info} \
--env LOG_HTML=${LOG_HTML:-false} \
--env CAPTCHA_SOLVER=${CAPTCHA_SOLVER:-none} \
--label cacher="oui" \
$IMAGE:latest


# --net=bridge \
# --dns 8.8.8.8 \

##########################################################################################################################################################
# Démarrage du Conteneur #
##########################
docker start $CONTENEUR

##########################################################################################################################################################
# Code Retour en Fermeture #
############################
exit 0
